/*
 Navicat Premium Data Transfer

 Source Server         : 本地
 Source Server Type    : MySQL
 Source Server Version : 50727
 Source Host           : localhost:3306
 Source Schema         : xzsd

 Target Server Type    : MySQL
 Target Server Version : 50727
 File Encoding         : 65001

 Date: 28/06/2020 20:42:27
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for t_sys_business
-- ----------------------------
DROP TABLE IF EXISTS `t_sys_business`;
CREATE TABLE `t_sys_business`  (
  `business_code` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '商家编码',
  `business_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '商家名称',
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `is_delete` int(11) NOT NULL COMMENT '作废标记 0:否 1:是',
  `created_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `created_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '创建人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  `updated_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '更新时间',
  `updated_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '跟新人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 4 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '商家表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_sys_business
-- ----------------------------
INSERT INTO `t_sys_business` VALUES ('c854480b900111ea881c00ff093e0965', '当当网上书店', 1, 0, '2020-05-07 09:26:05', 'admin', '2020-05-07 09:26:05', 'admin');
INSERT INTO `t_sys_business` VALUES ('cb28de6f900111ea881c00ff093e0965', '新华书店', 2, 0, '2020-05-07 09:26:10', 'admin', '2020-05-07 09:26:10', 'admin');
INSERT INTO `t_sys_business` VALUES ('cd3e1e68900111ea881c00ff093e0965', '先锋上书店', 3, 0, '2020-05-07 09:26:13', 'admin', '2020-05-07 09:26:13', 'admin');

-- ----------------------------
-- Table structure for t_sys_category
-- ----------------------------
DROP TABLE IF EXISTS `t_sys_category`;
CREATE TABLE `t_sys_category`  (
  `cate_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '分类名称',
  `cate_code` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '分类编码（全表唯一） 用来创建菜单层级关系（随机数）',
  `remark` varchar(400) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '备注',
  `parent_cate_code` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '父级分类编码（取得父级菜单 的cate_code ）',
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `is_delete` int(11) NOT NULL COMMENT '作废标记 0:否 1:是',
  `created_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP(0) COMMENT '创建时间',
  `created_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '创建人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  `updated_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '更新时间',
  `updated_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '跟新人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 72 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '商品分类表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_sys_category
-- ----------------------------
INSERT INTO `t_sys_category` VALUES ('文学', '799f8e61a59011eaa9c900163e08aec4', '文学分类', '0', 40, 0, '2020-06-03 19:50:52', 'pdc', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('自然科学', '99c9cea8a59011eaa9c900163e08aec4', '自然科学', '0', 41, 0, '2020-06-03 19:51:46', 'pdc', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('经典', 'a9881e68a59011eaa9c900163e08aec4', '经典文学', '799f8e61a59011eaa9c900163e08aec4', 42, 0, '2020-06-04 17:35:45', 'pdc', '2020-06-04 17:35:45', 'admin');
INSERT INTO `t_sys_category` VALUES ('现代文学', 'c376d2d6a59011eaa9c900163e08aec4', '现代文学', '799f8e61a59011eaa9c900163e08aec4', 43, 0, '2020-06-03 19:52:56', 'pdc', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('自然人文科学', 'd1933127a59011eaa9c900163e08aec4', '人文科学', '99c9cea8a59011eaa9c900163e08aec4', 44, 0, '2020-06-03 23:09:24', 'pdc', '2020-06-03 23:09:24', 'zf');
INSERT INTO `t_sys_category` VALUES ('其他', 'ebf7c927a59011eaa9c900163e08aec4', '其他', '0', 45, 0, '2020-06-03 19:54:04', 'pdc', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('小说', '908c914da59811eaa9c900163e08aec4', '小说', '0', 46, 0, '2020-06-04 08:57:36', 'pdc', '2020-06-04 08:57:36', 'admin');
INSERT INTO `t_sys_category` VALUES ('戏剧', 'be7371aba5fd11eaa9c900163e08aec4', '', '799f8e61a59011eaa9c900163e08aec4', 47, 0, '2020-06-04 08:53:02', 'admin', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('艺术', 'fdbf2796a5fd11eaa9c900163e08aec4', '艺术类别', '0', 48, 0, '2020-06-04 08:54:49', 'admin', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('影视艺术', '30653352a5fe11eaa9c900163e08aec4', '', 'fdbf2796a5fd11eaa9c900163e08aec4', 49, 0, '2020-06-04 08:56:14', 'admin', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('建筑艺术', '46c2d8b1a5fe11eaa9c900163e08aec4', '', 'fdbf2796a5fd11eaa9c900163e08aec4', 50, 0, '2020-06-04 08:56:51', 'admin', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('设计', '4cd8ba62a5fe11eaa9c900163e08aec4', '', 'fdbf2796a5fd11eaa9c900163e08aec4', 51, 0, '2020-06-04 08:57:01', 'admin', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('世界名著', '73886369a5fe11eaa9c900163e08aec4', '', '908c914da59811eaa9c900163e08aec4', 52, 0, '2020-06-04 08:58:06', 'admin', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('中国古典小说', '7ea91112a5fe11eaa9c900163e08aec4', '', '908c914da59811eaa9c900163e08aec4', 53, 0, '2020-06-04 08:58:25', 'admin', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('武侠小说', 'b2ea151fa5fe11eaa9c900163e08aec4', '武侠小说', '908c914da59811eaa9c900163e08aec4', 54, 0, '2020-06-04 13:18:02', 'admin', '2020-06-04 13:18:02', 'lh');
INSERT INTO `t_sys_category` VALUES ('旅游', '0aa6c9a9a5ff11eaa9c900163e08aec4', '', '0', 55, 0, '2020-06-04 09:02:20', 'admin', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('生存探险', '1c911620a5ff11eaa9c900163e08aec4', '人生本来就是一次冒险', '0aa6c9a9a5ff11eaa9c900163e08aec4', 56, 0, '2020-06-04 13:43:27', 'admin', '2020-06-04 13:43:27', 'admin');
INSERT INTO `t_sys_category` VALUES ('人文之旅', '3f81aea7a5ff11eaa9c900163e08aec4', '', '0aa6c9a9a5ff11eaa9c900163e08aec4', 57, 0, '2020-06-04 09:03:48', 'admin', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('教辅', 'b591bf75a5ff11eaa9c900163e08aec4', '作为学校教育之外的辅导书籍\n', '0', 58, 0, '2020-06-04 09:07:06', 'xhl', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('高一', 'c97a1a6fa5ff11eaa9c900163e08aec4', '主要面向于高一年级学生\n', 'b591bf75a5ff11eaa9c900163e08aec4', 59, 0, '2020-06-04 09:07:40', 'xhl', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('语文', 'e79eaafaa5ff11eaa9c900163e08aec4', '该教辅资料适用于语文课文', 'c97a1a6fa5ff11eaa9c900163e08aec4', 60, 1, '2020-06-04 12:42:55', 'xhl', '2020-06-04 12:42:55', 'xhl');
INSERT INTO `t_sys_category` VALUES ('数学', 'fb73ec4ca5ff11eaa9c900163e08aec4', '该教辅资料适用于数学教育', '0', 61, 0, '2020-06-04 09:09:04', 'xhl', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('计算机', 'fe89e4d8a61111eaa9c900163e08aec4', '计算机类书籍', '0', 62, 1, '2020-06-04 16:51:10', 'wwj', '2020-06-04 16:51:10', 'wwj');
INSERT INTO `t_sys_category` VALUES ('高二', '3456f31ea61211eaa9c900163e08aec4', '大大发放', 'b591bf75a5ff11eaa9c900163e08aec4', 63, 1, '2020-06-04 13:30:18', 'admin', '2020-06-04 13:30:18', 'admin');
INSERT INTO `t_sys_category` VALUES ('英语', '3d614209a61211eaa9c900163e08aec4', '暂无', '3456f31ea61211eaa9c900163e08aec4', 64, 1, '2020-06-04 12:43:00', 'admin', '2020-06-04 12:43:00', 'xhl');
INSERT INTO `t_sys_category` VALUES ('高二', '53e5fc47a62511eaa9c900163e08aec4', '五年高考三年模拟', 'b591bf75a5ff11eaa9c900163e08aec4', 66, 1, '2020-06-04 17:34:39', 'admin', '2020-06-04 17:34:39', 'admin');
INSERT INTO `t_sys_category` VALUES ('高二', 'b5db4a2fa64a11eaa9c900163e08aec4', '适用于高二学生', '0', 67, 1, '2020-06-04 18:04:04', 'xhl', '2020-06-04 18:04:04', 'xhl');
INSERT INTO `t_sys_category` VALUES ('高二', 'c1ca6650a64a11eaa9c900163e08aec4', '适用于高二学生', 'b591bf75a5ff11eaa9c900163e08aec4', 68, 0, '2020-06-04 18:04:19', 'xhl', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('童书', '2596da2ca65a11eaa9c900163e08aec4', '买一本给自己的孩子看看吧', '0', 69, 0, '2020-06-04 19:54:29', 'xhl', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('中国儿童文学', '35607a0fa65a11eaa9c900163e08aec4', '主要内容以中文为主的儿童书籍\n', '2596da2ca65a11eaa9c900163e08aec4', 70, 0, '2020-06-04 19:54:56', 'xhl', '2020-06-28 17:44:46', NULL);
INSERT INTO `t_sys_category` VALUES ('外国儿童文学', '5a72d628a65a11eaa9c900163e08aec4', '主要是以各种外语为主的儿童书籍，比如：俄语、德语、法语、日语、英语等', '2596da2ca65a11eaa9c900163e08aec4', 71, 0, '2020-06-04 19:55:58', 'xhl', '2020-06-28 17:44:46', NULL);

-- ----------------------------
-- Table structure for t_sys_customer
-- ----------------------------
DROP TABLE IF EXISTS `t_sys_customer`;
CREATE TABLE `t_sys_customer`  (
  `user_account` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '用户的登录账号',
  `user_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '用户名称',
  `user_sex` int(11) NOT NULL COMMENT '用户性别 0 女 1 男 2未知',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '用户的手机号',
  `email` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '用户的邮箱',
  `id_card` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '用户的身份证',
  `password` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '用户登录密码',
  `score` decimal(8, 2) NOT NULL COMMENT '用户积分',
  `is_admin` int(11) NOT NULL COMMENT '登录源标记 0 :App注册、登录 1:PC注册、登录',
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `is_delete` int(11) NOT NULL COMMENT '作废标记 0:否 1:是',
  `created_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `created_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT 'admin' COMMENT '创建人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  `updated_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '更新时间',
  `updated_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '跟新人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 49 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '用户表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_sys_customer
-- ----------------------------
INSERT INTO `t_sys_customer` VALUES ('admin', 'admin', 1, '1', '1', '1', '202cb962ac59075b964b07152d234b70', 10000.00, 1, 1, 0, '2020-05-16 13:58:25', 'admin', '2020-06-04 17:27:15', 'admin');

-- ----------------------------
-- Table structure for t_sys_goods
-- ----------------------------
DROP TABLE IF EXISTS `t_sys_goods`;
CREATE TABLE `t_sys_goods`  (
  `sku_name` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '商品名称',
  `isbn` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '标准书号',
  `first_cate_code` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '一级商品分类',
  `second_cate_code` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '二级商品分类',
  `sku_ad` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '广告词',
  `sku_introduction` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '商品介绍',
  `business_code` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '商家编码',
  `store_num` int(11) NOT NULL COMMENT '商家库存',
  `cost_price` decimal(8, 2) NOT NULL COMMENT '定价',
  `sale_price` decimal(8, 2) NOT NULL COMMENT '销售价',
  `sku_status` int(11) NOT NULL COMMENT '0:在售  1:已下架  2:未发布',
  `sku_code` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '商品编码',
  `sale_num` int(11) DEFAULT NULL COMMENT '商品已售数量',
  `sale_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '商品上架时间',
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `is_delete` int(11) NOT NULL COMMENT '作废标记 0:否 1:是',
  `created_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `created_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '创建人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  `updated_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '更新时间',
  `updated_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '跟新人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 132 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '商品表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_sys_goods
-- ----------------------------
INSERT INTO `t_sys_goods` VALUES ('红楼梦', 'jdwx001', '799f8e61a59011eaa9c900163e08aec4', 'a9881e68a59011eaa9c900163e08aec4', '来体验贾宝玉林黛玉的爱情故事', 'string', 'c854480b900111ea881c00ff093e0965', 44, 59.99, 50.00, 0, '2020060414174548216', 3, '2020-06-04 14:17:45', 62, 0, '2020-06-04 14:17:45', 'pdc', '2020-06-05 08:52:24', 'pdc');
INSERT INTO `t_sys_goods` VALUES ('红楼梦', 'jdwx001', '799f8e61a59011eaa9c900163e08aec4', 'a9881e68a59011eaa9c900163e08aec4', '红楼梦', '红楼梦', 'cb28de6f900111ea881c00ff093e0965', 90, 56.66, 50.00, 0, '2020060414184344159', 2, '2020-06-04 14:18:43', 63, 0, '2020-06-04 14:18:43', 'pdc', '2020-06-04 22:37:46', 'wwj');
INSERT INTO `t_sys_goods` VALUES ('骆驼祥子', 'xdwx001', '799f8e61a59011eaa9c900163e08aec4', 'c376d2d6a59011eaa9c900163e08aec4', '骆驼祥子', '骆驼祥子', 'cd3e1e68900111ea881c00ff093e0965', 10, 52.50, 51.00, 0, '2020060414204150788', 0, '2020-06-04 14:20:41', 64, 0, '2020-06-04 14:20:41', 'pdc', '2020-06-04 22:37:49', 'wwj');
INSERT INTO `t_sys_goods` VALUES ('高一 数学必修一', 'jiaofu', 'b591bf75a5ff11eaa9c900163e08aec4', 'c97a1a6fa5ff11eaa9c900163e08aec4', '多记公式定理，掌握解题技巧，熟悉各种题型', '高一数学是指在高一时学的数学，高一数学的知识掌握较多，高一试题约占高考得分的60%，一学年要学五本书，只要把高一的数学掌握牢靠，高二，高三则只是对高一的复习与补充。', 'cb28de6f900111ea881c00ff093e0965', 210, 56.00, 54.00, 0, '2020060414234457057', 0, '2020-06-04 14:23:44', 65, 0, '2020-06-04 14:23:44', 'zcc', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('笑傲江湖', 'xs001', '908c914da59811eaa9c900163e08aec4', 'b2ea151fa5fe11eaa9c900163e08aec4', '《笑傲江湖》的中心是武林争霸夺权，为了达到目的，夺取《辟邪剑谱》和《葵花宝典》，最后两派都败在《辟邪剑谱》和《葵花宝典》上。', '《笑傲江湖》属于金庸的后期作品，其叙事状物，已到炉火纯青、出神入化的境界。《笑傲江湖》所涉及的场景、人物以及各类武林人物交手搏斗的场面不可胜数，但历历写来，景随情转，变化无穷而皆能贴合生活。', 'c854480b900111ea881c00ff093e0965', 50, 64.00, 69.00, 0, '2020060418041800606', 0, '2020-06-04 18:04:18', 75, 0, '2020-06-04 18:04:18', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('天龙八部', 'xs002', '908c914da59811eaa9c900163e08aec4', 'b2ea151fa5fe11eaa9c900163e08aec4', '《天龙八部》一书以北宋、辽、西夏、大理并立的历史为宏大背景，将儒释道、琴棋书画等中国传统文化融会贯通其中，书中人物繁多，个性鲜明，情节离奇，尽显芸芸众生百态。', '丐帮帮主乔峰与大理国王子段誉、少林弟子虚竹结为兄弟。他身为大宋武林第一大帮帮主，发现自己竟是契丹人，虽受尽中原武林人士唾弃而不肯以怨报怨；他身为辽国南院大王，却甘愿背上叛族罪名，最终以悲壮的自杀来阻止辽国发兵攻宋，不愧为顶天立地的大英雄。', 'cb28de6f900111ea881c00ff093e0965', 52, 54.00, 59.00, 0, '2020060418054803543', 0, '2020-06-04 18:05:48', 76, 0, '2020-06-04 18:05:48', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('射雕英雄传', 'xs003', '908c914da59811eaa9c900163e08aec4', 'b2ea151fa5fe11eaa9c900163e08aec4', '《射雕英雄传》又名《大漠英雄传》，是“射雕三部曲”之一，下接《神雕侠侣》和《倚天屠龙记》。', '这部小说历史背景突出，场景纷繁，气势宏伟，具有鲜明的“英雄史诗”风格。在人物创造与情节安排上，它打破了传统武侠小说一味传奇，将人物作为情节附庸的模式，坚持以创造个性化的人物形象为中心，坚持人物统帅故事，按照人物性格的发展需要及其内在可能性、必然性来设置情节，从而使这部小说达到了事虽奇人却真的妙境。', 'cd3e1e68900111ea881c00ff093e0965', 60, 57.00, 65.00, 0, '2020060418071258089', 0, '2020-06-04 18:07:12', 77, 0, '2020-06-04 18:07:12', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('挪威的森林', 'xdwx001', '799f8e61a59011eaa9c900163e08aec4', 'c376d2d6a59011eaa9c900163e08aec4', '少男少女在复杂的现代生活中对于纯真爱情和个性的双重追求……超出了一般爱情描写的俗套，而具有更为深刻的人生意义。', '本书是日本小说家村上春树的长篇小说，描写一个背井离乡的大学生，爱上了一个忧郁深情的少女，同时也被一个热情奔放的少女所吸引，在两个少女之间徘徊，表现了初涉人世的年轻人的独特爱情观，是一部非常规的青春恋爱小说，也是作者的名作。', 'cb28de6f900111ea881c00ff093e0965', 52, 56.00, 66.00, 0, '2020060418281248593', 1, '2020-06-04 18:28:12', 78, 0, '2020-06-04 18:28:12', 'lh', '2020-06-04 20:35:53', 'admin');
INSERT INTO `t_sys_goods` VALUES ('边城', 'xdwx002', '799f8e61a59011eaa9c900163e08aec4', 'c376d2d6a59011eaa9c900163e08aec4', '当光影与文字都越发浮华， 热闹中却有人让我们知道生活的真实——不过如此的平凡。 故事就这么展开了，发生了，过去了…… 安静的文字，仿佛被溪水荡涤得清透明亮。', '《边城》是沈从文的代表作，是一部中篇小说，凭此书一举奠定了其在文学史上的重要地位。书中寄托着作者关于“美”与“爱”的美学理想，是较能表现人性美的一部作品。小说以20世纪30年代川湘交界的边城小镇茶峒为背景，以兼具抒情诗和小品文的优美笔触，描绘了湘西边城淳朴的世道民风和天然的生活状态。全书共二十一个章节，每个章节都似一幅或浓或淡的水墨画，以古朴清新的语言，表现出一种“优美、健康、自然而又不悖乎人性的人生形式”。\n', 'cb28de6f900111ea881c00ff093e0965', 52, 59.90, 0.00, 0, '2020060418443571535', 0, '2020-06-04 18:44:35', 79, 0, '2020-06-04 18:44:35', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('浮生六记', 'xdwx003', '799f8e61a59011eaa9c900163e08aec4', 'c376d2d6a59011eaa9c900163e08aec4', '《浮生六记》是清代文人沈复写作的自传散文。因其以真言述真情，从不刻意造作，得以浑然天成，独树一帜，达“乐而不淫，哀而不伤”之境界，深为后世文人所推崇，流传至今，已成经典。', '本次出版选开明书店民国本为底本，考以《雁来红丛报》本、霜枫社民国本、林语堂英译本重新点校；并请张佳玮精心译述，作长文译记为读者导读；独家收录林曦手绘彩画12幅、“沈复的一生”（年表）、“沈复三十年游历图”，并附“光绪三年初版序”“潘麐生题记”“光绪三年初版跋”，便于读者朋友更好读懂中国挚美经典，从中获益。', 'cd3e1e68900111ea881c00ff093e0965', 35, 42.00, 49.90, 0, '2020060418471933709', 0, '2020-06-04 18:47:19', 80, 0, '2020-06-04 18:47:19', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('我与地坛', 'xdwx004', '799f8e61a59011eaa9c900163e08aec4', 'c376d2d6a59011eaa9c900163e08aec4', '要是有些事我没说，地坛，你别以为是我忘了，我什么也没忘；但是有些事只适合收藏，不能说，不能想，却又不能忘……', '《我与地坛(纪念版)》是史铁生文学作品中，充满哲思又极为人性化的代表作之一。其前两段被纳入人民教育出版社的高一教材中。前两部分注重讲地坛和他与母亲的后悔，对中学生来说，这是一篇令人反思的优秀文章。', 'c854480b900111ea881c00ff093e0965', 42, 35.00, 39.00, 0, '2020060418491925188', 0, '2020-06-04 18:49:19', 81, 0, '2020-06-04 18:49:19', 'lh', '2020-06-04 22:38:06', 'wwj');
INSERT INTO `t_sys_goods` VALUES ('自在独行', 'xdwx005', '799f8e61a59011eaa9c900163e08aec4', 'c376d2d6a59011eaa9c900163e08aec4', '一个自在独行者的文字，完美展现了个人与世界相处之妙。从孤独、行走、生死、慈悲、玩物、天地、人事等角度，给内心孤独焦躁者以安宁的抚慰。', '贾平凹执笔40年，奠定散文文坛地位之作，研磨孤独，收获自在，致每个孤独的行路人。', 'cb28de6f900111ea881c00ff093e0965', 25, 40.00, 49.00, 1, '2020060418513069669', 0, '2020-06-04 18:51:30', 82, 0, '2020-06-04 18:51:30', 'lh', '2020-06-04 22:37:56', 'wwj');
INSERT INTO `t_sys_goods` VALUES ('古希腊悲剧喜剧全集', 'xj001', '799f8e61a59011eaa9c900163e08aec4', 'be7371aba5fd11eaa9c900163e08aec4', '以剑桥勒伯古典版古希腊文本为依托，收集所有古希腊的传世戏剧作品。', '位于地中海东北部的希腊, 是欧洲文化的摇篮, 人类戏剧的最早发源地。古希腊悲、喜剧都与酒神庆典和民间滑稽演出有着血缘关系。古希腊戏剧作为人类文明史上第一个伟大的戏剧时代，几乎在诞生之时，就耸立起了一座人类戏剧史上难以企及的艺术高峰。译林出版社邀请张竹明、王焕生两位专家，首次将现存于世的32部古希腊悲剧作品和18部喜剧、新喜剧作品全部搜齐、翻译、梳理并汇集成八卷巨著,即《埃斯库罗斯悲剧》、《索福克勒斯悲剧》、《欧里庇德斯悲剧》(上、中、下)、《阿里斯托芬喜剧》(上、下)、《米南德喜剧》，古希腊最著名的三大悲剧家埃斯库罗斯、索福克勒斯、欧里庇得斯与伟大喜剧作家阿里斯托芬、新喜剧作家米南德的剧作尽收其中。', 'cd3e1e68900111ea881c00ff093e0965', 42, 355.00, 399.00, 0, '2020060418552581664', 0, '2020-06-04 18:55:25', 83, 0, '2020-06-04 18:55:25', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('哈姆雷特', 'xj002', '799f8e61a59011eaa9c900163e08aec4', 'be7371aba5fd11eaa9c900163e08aec4', '《哈姆莱特》一直以来被誉为莎士比亚的巅峰之作。这部作品叙述了丹麦王子哈姆莱特为父报仇的故事。', '哈姆莱特在德国读书时，他的叔父克劳狄斯毒死老哈姆莱特，篡夺了王位，并霸占了哈姆莱特的母亲。哈姆莱特回国后，决定为父报仇。结果他误杀了情人奥非利娅的父亲，奥菲利娅因此疯癫自尽。国王乘机挑拨波洛涅斯的儿子雷欧提斯以比剑为名，设计用毒剑刺死了哈姆莱特。该剧的结尾，哈姆莱特、国王、王妃、雷欧提斯同归于尽。', 'cd3e1e68900111ea881c00ff093e0965', 35, 83.00, 89.90, 0, '2020060418581676528', 0, '2020-06-04 18:58:16', 84, 0, '2020-06-04 18:58:16', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('三国演义', 'gdxs001', '908c914da59811eaa9c900163e08aec4', '7ea91112a5fe11eaa9c900163e08aec4', '一个时代的风云变幻', '三国演义', 'c854480b900111ea881c00ff093e0965', 100, 129.00, 149.00, 0, '2020060419000490830', 0, '2020-06-04 19:00:04', 85, 0, '2020-06-04 19:00:04', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('罗密欧与朱丽叶', 'xj003', '799f8e61a59011eaa9c900163e08aec4', 'be7371aba5fd11eaa9c900163e08aec4', '《罗密欧与朱丽叶》是莎士比亚著名戏剧作品之一。', '这部作品叙述了丹麦王子哈姆莱特为父报仇的故事。哈姆莱特在德国读书时，他的叔父克劳狄斯毒死老哈姆莱特，篡夺了王位，并霸占了哈姆莱特的母亲。哈姆莱特回国后，决定为父报仇。结果他误杀了情人奥非利娅的父亲，奥菲利娅因此疯癫自尽。国王乘机挑拨波洛涅斯的儿子雷欧提斯以比剑为名，设计用毒剑刺死了哈姆莱特。该剧的结尾，哈姆莱特、国王、王妃、雷欧提斯同归于尽。', 'cb28de6f900111ea881c00ff093e0965', 123, 89.00, 99.00, 0, '2020060419021897537', 0, '2020-06-04 19:02:19', 86, 0, '2020-06-04 19:02:19', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('李尔王', 'xj004', '799f8e61a59011eaa9c900163e08aec4', 'be7371aba5fd11eaa9c900163e08aec4', '李尔王', '本书李尔王是传说中古不列颠的国王，专横而爱听诌媚。他把国土和权力分给巧言令色、心怀叵测的两个大女儿，却赶出诚实朴素的小女儿，不给嫁奁。李尔受大女儿虐待后，愤而出走荒原，在暴风雨中醒悟过来，随即变疯。此剧揭露了人性中利欲熏心、追求权势的一面。剧情由几条线索构成，错综复杂，紧张紧凑；语言丰富生动，多有哲理。', 'cd3e1e68900111ea881c00ff093e0965', 23, 42.00, 49.90, 0, '2020060419034647163', 0, '2020-06-04 19:03:46', 87, 0, '2020-06-04 19:03:46', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('飞鸟集', 'jd001', '799f8e61a59011eaa9c900163e08aec4', 'a9881e68a59011eaa9c900163e08aec4', '让思想穿越黑暗，给生活添点诗意！生如夏花之绚烂，在人生的历程中，接受美，奉献美！\n', '飞鸟集   新月集', 'c854480b900111ea881c00ff093e0965', 52, 56.00, 63.00, 0, '2020060419064914762', 0, '2020-06-04 19:06:49', 88, 0, '2020-06-04 19:06:49', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('西游记', 'jdwx002', '799f8e61a59011eaa9c900163e08aec4', 'a9881e68a59011eaa9c900163e08aec4', '西游记', '西游记', 'c854480b900111ea881c00ff093e0965', 10, 69.99, 59.00, 0, '2020060419075379485', 0, '2020-06-04 19:07:53', 89, 0, '2020-06-04 19:07:53', 'pdc', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('人间词话', 'jd002', '799f8e61a59011eaa9c900163e08aec4', 'a9881e68a59011eaa9c900163e08aec4', '盛传一百多年的不朽巨著，流转一个世纪的诗词经典。', '古今之成大事业、大学问者，必经过三种之境界：\n“昨夜西风凋碧树。独上高楼，望尽天涯路”，此第一境也。\n“衣带渐宽终不悔，为伊消得人憔悴”，此第二境也。\n“众里寻他千百度，蓦然回首，那人却在，灯火阑珊处”，此第三境也。\n——王国维', 'cd3e1e68900111ea881c00ff093e0965', 20, 66.00, 79.90, 0, '2020060419093707139', 0, '2020-06-04 19:09:37', 90, 0, '2020-06-04 19:09:37', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('梦里花落知多少', 'jd005', '799f8e61a59011eaa9c900163e08aec4', 'a9881e68a59011eaa9c900163e08aec4', '她以一支笔坚持看守个人文字上的简单和朴素；从遥远的撒哈拉到敦煌戈壁，她不随波逐流，也不诠释人生，只做生活的见证者；她是我们心中浪漫、洒脱、真性情的永远的三毛，永恒的传奇。', '《梦里花落知多少》是三毛作品中极沉重的一部，荷西的突然离世给她的人生带来了巨大的打击。行文中平静的语调掩藏不了死别的伤痛，而哀恸过后的坚强，让这位深情女子更加美丽，她以深沉的笔，表达了走出阴霾的勇气。', 'cd3e1e68900111ea881c00ff093e0965', 53, 25.00, 29.90, 0, '2020060419115241248', 0, '2020-06-04 19:11:52', 91, 0, '2020-06-04 19:11:52', 'lh', '2020-06-04 20:35:22', 'admin');
INSERT INTO `t_sys_goods` VALUES ('自然史', 'zr001', '99c9cea8a59011eaa9c900163e08aec4', 'd1933127a59011eaa9c900163e08aec4', '精彩论述地球、人类、动物等的演变史', '自然史', 'c854480b900111ea881c00ff093e0965', 58, 12.00, 19.90, 0, '2020060419135873578', 0, '2020-06-04 19:13:58', 92, 0, '2020-06-04 19:13:58', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('花与树的人文之旅', 'za12677', '99c9cea8a59011eaa9c900163e08aec4', 'd1933127a59011eaa9c900163e08aec4', '自然感悟', '这是一本结合植物起源、发布、归类、比较的科学历史和植物在不同文化中的被认知、在中外经济文化交流进程中被传播的人文历史，从科学性、人文性、趣味性出发介绍多种植物在不同文化中如何被认知、如何随着经济、宗教、文化进程而传播的科普书。', 'c854480b900111ea881c00ff093e0965', 53, 23.00, 29.90, 0, '2020060419153067830', 0, '2020-06-04 19:15:30', 93, 0, '2020-06-04 19:15:30', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('中华人文自然百科', 'zr004', '99c9cea8a59011eaa9c900163e08aec4', 'd1933127a59011eaa9c900163e08aec4', '就很棒', '》以诗歌、散文、小说和戏剧四大文体为版块，以时间顺序为线索，分条目地介绍和评价中华文学方面的有关知识，以期青少年朋友们通过阅读《中华人文自然百科:文学卷》，比较清晰地了解我国文学发生、演变的基本流程，从中获得美好的精神感受，增强民族自信心，并由此借鉴前贤艺术经验，发扬光大中华文学优秀传统。', 'c854480b900111ea881c00ff093e0965', 20, 56.00, 69.00, 0, '2020060419174326996', 0, '2020-06-04 19:17:43', 94, 0, '2020-06-04 19:17:43', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('莱茵星光', 'zr006', '99c9cea8a59011eaa9c900163e08aec4', 'd1933127a59011eaa9c900163e08aec4', '一位爱乐者的欧行漫记', '这是关于欧洲历史文化音乐至为精到的一部随笔集。绝非去欧洲旅游几趟回来的信笔闲篇，而是作者在欧洲工作二十多年亲身经历的生活与游历的感受。然而作者所谈不只有美丽的欧洲图画和引人的历史；尤其是作者把自己对古典音乐的感受和深刻见解十分丰满地表现出来，实属难得。作者把欧洲文化的精粹集于一炉，思想、文化、音乐、美景、美食，行文间，活色生香，交响乐的震撼和葡萄酒的醇香扑面而来。', 'cb28de6f900111ea881c00ff093e0965', 12, 53.00, 59.90, 0, '2020060419192469565', 2, '2020-06-04 19:19:24', 95, 0, '2020-06-04 19:19:24', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('茶馆', 'ys001', 'fdbf2796a5fd11eaa9c900163e08aec4', '30653352a5fe11eaa9c900163e08aec4', '《茶馆》是现代作家老舍的话剧名作，也是北京人民艺术剧院常演不衰的经典剧目。', '《茶馆》是现代作家老舍的话剧名作，也是北京人民艺术剧院常演不衰的经典剧目。本剧1957年完成，1958年由北京人民艺术剧院首排，通过一个茶馆写出了近现代社会和时代的缩影。本书配用了现代著名画家叶浅予的插图二十幅。', 'cb28de6f900111ea881c00ff093e0965', 13, 46.00, 49.70, 0, '2020060419223799811', 0, '2020-06-04 19:22:38', 96, 0, '2020-06-04 19:22:38', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('把所有失眠的夜都给你', 'ys002', 'fdbf2796a5fd11eaa9c900163e08aec4', '30653352a5fe11eaa9c900163e08aec4', '这是眠去在电影和现实之间对爱情和命运的衔接，每个人物或微小或著名于世，或平淡或起伏，都如那个茫茫人海中独自前行的你一样尝尽悲欢离合。', '她们都是一个完整的命运轮回，也是一个完整的生命之路。有自己的固执、有自己的炽热，有沮丧有幸福，有每个人不一样的温柔，有不一样的坚持。\n她们的爱与温柔铺陈在她们的命运之下时，其中的百转千回与辛酸流泪显得庞大又那么渺小。就像某个夜晚，我们会被温柔和幸福充满心灵，充满房间，直至充满这座城，整个世界，我们也会有一瞬间被无力和悲伤击倒，世界都崩塌。', 'cb28de6f900111ea881c00ff093e0965', 50, 46.00, 52.00, 0, '2020060419251187415', 0, '2020-06-04 19:25:11', 97, 0, '2020-06-04 19:25:11', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('电影剧作理论与技巧', 'ys003', 'fdbf2796a5fd11eaa9c900163e08aec4', '30653352a5fe11eaa9c900163e08aec4', '电影制作理论与技巧', '作者对影片叙事、剧本写作的决定因素，故事的写作过程，故事的主题，故事的人物，故事的情节与结构，电影中的时空观念，对白与音效等进行了详细的论述。内容丰富，图文并茂。', 'cd3e1e68900111ea881c00ff093e0965', 46, 42.00, 552.00, 2, '2020060419265863414', 0, '2020-06-04 19:26:58', 98, 0, '2020-06-04 19:26:58', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('不必交谈的时刻', 'ys007', 'fdbf2796a5fd11eaa9c900163e08aec4', '30653352a5fe11eaa9c900163e08aec4', '作者对影片叙事、剧本写作的决定因素，故事的写作过程，故事的主题，故事的人物，故事的情节与结构，电影中的时空观念，对白与音效等进行了详细的论述。内容丰富，图文并茂。', '热爱，冷淡，坚韧，自觉，全然投入，置身事外。对于生活秩序与内心秩序的重建，樊小纯沉着且一意孤行。她的文字总是先人一步地准确。\n“索引”或许是进入这本书的最好方式。直观、即兴。这种阅读的驱力将使人回归沉寂，并于沉寂之中获得力量。', 'cb28de6f900111ea881c00ff093e0965', 30, 23.00, 32.90, 2, '2020060419294064580', 0, '2020-06-04 19:29:40', 99, 0, '2020-06-04 19:29:40', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('教你如何欣赏建筑艺术', 'jz001', 'fdbf2796a5fd11eaa9c900163e08aec4', '46c2d8b1a5fe11eaa9c900163e08aec4', '用最简单的语言介绍建筑艺术的特性与建筑艺术语言，谈谈建筑艺术作品欣赏的角度与方法。', NULL, 'cd3e1e68900111ea881c00ff093e0965', 24, 45.00, 56.00, 0, '2020060419323820710', 0, '2020-06-04 19:32:38', 100, 0, '2020-06-04 19:32:38', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('凝固的符号', 'jz002', 'fdbf2796a5fd11eaa9c900163e08aec4', '46c2d8b1a5fe11eaa9c900163e08aec4', '本书主要介绍了中外建筑、园林发展的历程，以及中外建筑、园林的主要外形构造特征，并且比较详细地介绍了中外建筑、园林的审美情趣和其中的人文内涵。', '中国建筑的优美与园林的萧疏、恬静之美，形成了一阴一阳的对比。西方建筑与园林合为一体，构成了富丽、壮美的景观。通过对比，人们在如诗如画的景色中漫步，看到了其中的奥秘，从而更加感受他们带来的美感，追求美的冲动会带给他们无穷的欢乐。', 'c854480b900111ea881c00ff093e0965', 52, 68.00, 99.00, 2, '2020060419342843854', 0, '2020-06-04 19:34:28', 101, 0, '2020-06-04 19:34:28', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('用光设计', 'jz003', 'fdbf2796a5fd11eaa9c900163e08aec4', '46c2d8b1a5fe11eaa9c900163e08aec4', '建筑照明设计的艺术', '照明知识入门读本，介绍和阐述光、视觉与颜色的相关知识和测量，从光源、电器、灯具、控制系统的知识到照明设计的基本原理、设计方法、设计步骤以及图纸和实施，是读者全面了解照明知识，学习照明设计方法，和理解照明设计的一本专业书籍。', 'c854480b900111ea881c00ff093e0965', 52, 88.00, 99.00, 0, '2020060419365977604', 0, '2020-06-04 19:36:59', 102, 0, '2020-06-04 19:36:59', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('认识建筑', 'jz005', 'fdbf2796a5fd11eaa9c900163e08aec4', '46c2d8b1a5fe11eaa9c900163e08aec4', '丰子恺建筑六讲', '“丰子恺艺术启蒙系列”之《认识绘画》《认识建筑》《美的情绪》皆源于此，在尊重丰子恺内文风格的基础上，对文章体例和顺序做了适当调整，并新增图片几百幅，以便当下读者更好地理解丰子恺先生的艺术世界。', 'c854480b900111ea881c00ff093e0965', 68, 99.00, 110.00, 0, '2020060419392660325', 0, '2020-06-04 19:39:26', 103, 0, '2020-06-04 19:39:26', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('室内设计风格详解', 'jz008', 'fdbf2796a5fd11eaa9c900163e08aec4', '46c2d8b1a5fe11eaa9c900163e08aec4', '日本的室内设计往往会将观念性的事物浓缩到最为精练的程度，尽可能地将传统的日本设计符号，如榻榻米、茶庭、枯山水等，融入当代室内生活环境中，再融合日本的花道、茶道、书道等艺术形式，形成一种独特的日式空间美学，营造出日本室内设计特有的带有仪式化的禅境空间。', '详解日式风格，深度挖掘日式风格的历史与文化。从历史文化、设计元素、风格打造到案例解析，深度剖析日式空间设计的精髓，饱览和洋兼具的空间之美。', 'cb28de6f900111ea881c00ff093e0965', 45, 56.00, 63.00, 0, '2020060419415726709', 0, '2020-06-04 19:41:57', 104, 0, '2020-06-04 19:41:57', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('品牌设计法则', 'we2131', 'fdbf2796a5fd11eaa9c900163e08aec4', '46c2d8b1a5fe11eaa9c900163e08aec4', '本书作者能将全面的基础知识清晰、浅易地传授,难能可贵;重质不重量的图例选释,更值得赞许。', '品牌设计', 'cb28de6f900111ea881c00ff093e0965', 23, 66.00, 69.99, 2, '2020060419435167864', 0, '2020-06-04 19:43:51', 105, 0, '2020-06-04 19:43:51', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('设计中的逻辑', 'sj002', 'fdbf2796a5fd11eaa9c900163e08aec4', '46c2d8b1a5fe11eaa9c900163e08aec4', '本书试图从设计背后的逻辑层面回答这个问题，设计不仅仅是一种美，还是一种策略、一种思维方式，甚至一种生活方式。 ', '书中的十位撰稿人是不同设计 领域的顶尖人，有跨国公司的高管，著名的出版人，多年从事用户研究的设计师，等等。他们从各自的领域着手，分别站在设计师、管理者、客户乃至用户的角度，试图用理论与实践相结合的方式解读这种认知产生的原因，以及如何理解与改进自我的设计思维。', 'cd3e1e68900111ea881c00ff093e0965', 34, 88.00, 99.00, 2, '2020060419452197333', 0, '2020-06-04 19:45:22', 106, 0, '2020-06-04 19:45:22', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('合伙人制度', 'sj003', 'fdbf2796a5fd11eaa9c900163e08aec4', '4cd8ba62a5fe11eaa9c900163e08aec4', '以控制权为核心的顶层股权设计', '人力资源总监，财务总监，注册会计师，注册税务师，显要的职业经历，雄厚的专业背景，成功的操盘经验，确保对于合伙人制度跨界解读的专业性、可靠性、可行性。', 'cd3e1e68900111ea881c00ff093e0965', 53, 56.00, 59.90, 0, '2020060419464908283', 0, '2020-06-04 19:46:49', 107, 0, '2020-06-04 19:46:49', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('设计的方法', 'sj004', 'fdbf2796a5fd11eaa9c900163e08aec4', '4cd8ba62a5fe11eaa9c900163e08aec4', '没有灵感怎么办？这不应该阻碍你创作出色的设计作品。', '设计并非运气、灵感或者自说自话，它以向客户交付合理的、实用的作品为既定目标。《设计的方法》可以让你学到在日常工作的基础上如何创作高质量设计作品，以令客户更加满意。在《设计的方法》中介绍的设计方法来源于smashLAB设计公司的创意总监Eric Karjaluoto的成功实践，为你提供了解决视觉传达问题的切实可行的工作流程。', 'cb28de6f900111ea881c00ff093e0965', 53, 88.00, 99.00, 2, '2020060419482895418', 0, '2020-06-04 19:48:28', 108, 0, '2020-06-04 19:48:28', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('设计的语言', 'asd5768', 'fdbf2796a5fd11eaa9c900163e08aec4', '4cd8ba62a5fe11eaa9c900163e08aec4', '知名的英国设计评论家迪耶·萨迪奇透过被设计包围的生活，向我们呈现设计多彩的世界。', '作者援引设计史上的经典个案，包括万向灯、尼康相机、Lucky Strike烟盒、雪铁龙汽车、转盘式电话等，解说设计的本质，传达设计的意义，也通过对设计和时尚、奢侈、艺术之间关系的探讨来探明设计在社会生活中扮演的多样角色，带我们看清设计的过去、现在和未来！', 'cb28de6f900111ea881c00ff093e0965', 52, 76.00, 79.00, 2, '2020060419503387459', 0, '2020-06-04 19:50:33', 109, 0, '2020-06-04 19:50:33', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('鲁滨孙漂流记', 'sc001', '0aa6c9a9a5ff11eaa9c900163e08aec4', '1c911620a5ff11eaa9c900163e08aec4', '荒岛二十八年，人类进化史的缩影', '热爱冒险的鲁滨孙几次出海闯荡，遇到海难被困在荒岛之上。二十八年的孤岛生活仍然未能阻止他的冒险精神。面对死亡的威胁，他凭着坚忍的毅力，在蛮荒之地白手起家，造房子、修田地、种植粮食、驯化野兽，与食人族大战，勇夺叛变水手控制的商船，历尽千辛万苦，终于脱险，得到可观财富，成为一个时代的传奇人物。', 'cd3e1e68900111ea881c00ff093e0965', 42, 64.00, 70.00, 0, '2020060419530550401', 0, '2020-06-04 19:53:05', 110, 0, '2020-06-04 19:53:05', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('生存训练：知道这些就够了', 'sc002', '0aa6c9a9a5ff11eaa9c900163e08aec4', '1c911620a5ff11eaa9c900163e08aec4', '末日逃亡？荒野求生？什么才是人体的极限？', '严苛的挑战，极限的环境，谁能活下来？知道这些就够了。', 'cb28de6f900111ea881c00ff093e0965', 20, 73.00, 79.00, 2, '2020060419544167633', 0, '2020-06-04 19:54:41', 111, 0, '2020-06-04 19:54:41', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('荒野生存：阿拉斯加之死', 'sc003', '0aa6c9a9a5ff11eaa9c900163e08aec4', '1c911620a5ff11eaa9c900163e08aec4', '杰出探险类作家成名作。', '《荒野生存》是其成名作，出版后在美国主流社会刮起阅读旋风，雄踞《纽约时报》畅销书榜长达两年，以二十多种语言在世界各地出版，震撼千万读者心灵。', 'c854480b900111ea881c00ff093e0965', 46, 99.00, 126.00, 0, '2020060419563290923', 0, '2020-06-04 19:56:32', 112, 0, '2020-06-04 19:56:32', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('学会管自己（歪歪兔独立成长童话）', '23521768', '2596da2ca65a11eaa9c900163e08aec4', '35607a0fa65a11eaa9c900163e08aec4', '让孩子快乐入学、轻松学习，养成不马虎、不拖拉、不找借口……的好习惯', '让孩子快乐入学、轻松学习，养成不马虎、不拖拉、不找借口……的好习惯，独立品格、学习能力、社会适应三方面应对小学新环境的文学启蒙桥梁书童话故事。4-6岁亲子共读，7-9岁独立阅读。全10册赠入学准备手册', 'cd3e1e68900111ea881c00ff093e0965', 19, 128.00, 101.00, 0, '2020060419585627313', 1, '2020-06-04 19:58:56', 114, 0, '2020-06-04 19:58:56', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('野外探险旅行必备手册', 'sc005', '0aa6c9a9a5ff11eaa9c900163e08aec4', '1c911620a5ff11eaa9c900163e08aec4', '野外探险旅行是对体能、技能和知识的考验，也是很多蛰居都市的人乐于选择的一种休闲方式。野外探险旅行需注意什么？在野外如何生存？遇到危险怎么办？……', '野外探险必备哦', 'cd3e1e68900111ea881c00ff093e0965', 53, 75.00, 88.80, 0, '2020060420000557579', 0, '2020-06-04 20:00:05', 115, 0, '2020-06-04 20:00:05', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('草房子（精装典藏版）', '9787501614592', '2596da2ca65a11eaa9c900163e08aec4', '35607a0fa65a11eaa9c900163e08aec4', '影响数代亿万中国儿童/销量达20000万册)', '(男孩桑桑的童年成长史，“油麻地”乡村的丰富世情画卷/曹文轩享誉世界的儿童文学经典作品，翻译成英、法、俄、韩等文字出版/入选教育部语文课外阅读书目，影响数代亿万中国儿童/销量达20000万册)', 'c854480b900111ea881c00ff093e0965', 15, 49.00, 29.11, 0, '2020060420005571300', 0, '2020-06-04 20:00:55', 116, 0, '2020-06-04 20:00:55', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('欧洲一年', 'rw001', '0aa6c9a9a5ff11eaa9c900163e08aec4', '3f81aea7a5ff11eaa9c900163e08aec4', '学旅作家、厦大才子王宇昆最新留学随笔集，以学者之心，旅人之态带你领略人文气息的欧洲！', '在这本书里你可以看到：欧洲22国见闻一个人的留学史70张绝美图片自我疗愈抉择与放弃以及一颗年轻赤诚的心', 'cb28de6f900111ea881c00ff093e0965', 4, 43.00, 49.00, 0, '2020060420024414234', 0, '2020-06-04 20:02:44', 117, 0, '2020-06-04 20:02:44', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('猫的风工厂：全3册', '9787556092406', '2596da2ca65a11eaa9c900163e08aec4', '35607a0fa65a11eaa9c900163e08aec4', '治愈系日本童话', '治愈系日本童话，知名日本儿童文学译者周龙梅、魏雯倾情翻译，新美南吉童话奖得主水野良惠、博洛尼亚国际画展入围插画师伊津野果地诚意之作，堪比宫崎骏作品的灵动风格与深刻意境。(海豚传媒出品)', 'cb28de6f900111ea881c00ff093e0965', 79, 75.00, 71.20, 0, '2020060420024560456', 1, '2020-06-04 20:02:45', 118, 0, '2020-06-04 20:02:45', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('安德烈·塔可夫斯基:电影的元素', 'rw002', '0aa6c9a9a5ff11eaa9c900163e08aec4', '3f81aea7a5ff11eaa9c900163e08aec4', '一本书读懂安德烈·塔可夫斯基,珍贵的俄语文献和影像,带给你全新的观影之旅,入围“人文社科联合书单”评选的“2018人文社科年度好书”', '“有关该电影导演在文献上的重大贡献。罗伯特•伯德完全熟悉英语读者难以获得的俄语文献，他对电影构造的细微差别有着非凡的敏感度。”——P. 亚当斯•希特尼（普林斯顿大学视觉艺术教授）', 'c854480b900111ea881c00ff093e0965', 56, 86.00, 96.00, 0, '2020060420041190234', 0, '2020-06-04 20:04:11', 119, 0, '2020-06-04 20:04:11', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('窗边的小豆豆(2018版)', '9787544288590', '2596da2ca65a11eaa9c900163e08aec4', '5a72d628a65a11eaa9c900163e08aec4', '影响20世纪的儿童文学杰作', '中文简体版已突破1300万册，入选九年制义务教育小学语文课本，教育专家联袂推荐。这是一段真实的故事，被退学的“小豆豆”在充满爱与温暖的巴学园中快乐成长。爱心树童书', 'c854480b900111ea881c00ff093e0965', 13, 45.00, 39.50, 0, '2020060420044068262', 1, '2020-06-04 20:04:40', 120, 0, '2020-06-04 20:04:40', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('彩笔昔曾干气象：绝句之旅 ', '', '0aa6c9a9a5ff11eaa9c900163e08aec4', '3f81aea7a5ff11eaa9c900163e08aec4', '本书收集了作者边旅游边赏读绝句的文字数十篇，文字优美，意境开阔，讲解明晰，是学者赏析讲解古诗的散文代表之作。', '绝句之旅 ', 'cd3e1e68900111ea881c00ff093e0965', 23, 44.00, 49.90, 0, '2020060420054968363', 0, '2020-06-04 20:05:49', 121, 0, '2020-06-04 20:05:49', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('哈利·波特（套装1-7册）', '9787020146413', '2596da2ca65a11eaa9c900163e08aec4', '5a72d628a65a11eaa9c900163e08aec4', '迄今为止，哈利•波特的人生中没有魔法', '他和一点都不友善的德思礼夫妇，还有他们令人厌恶的儿子达力住在一起。哈利的房间是一个窄小的储物间，就在楼梯下面，而且十一年来他从未有过生日派对。\n但是有一天，猫头鹰信使突然送来一封神秘的信件，令人不敢相信的是，信里附着一张来自霍格沃茨魔法学校的录取哈利入学的通知书。\n哈利于九月一日带着他的猫头鹰乘着特快列车来到魔法学校。在学校里，他遇到了他一生中两个*好的朋友，体验了骑着飞天扫帚打球的运动，从课堂上和生活中的所有事物里学到了魔法。不仅如此，他还得知自己将有一个伟大而不可思议的命运……\n不过，他要先让自己死里逃生才行……\n\n《哈利·波特与密室》', 'cd3e1e68900111ea881c00ff093e0965', 0, 438.00, 147.00, 0, '2020060420065100929', 1, '2020-06-04 20:06:51', 122, 0, '2020-06-04 20:06:51', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('究竟之旅', '', '0aa6c9a9a5ff11eaa9c900163e08aec4', '3f81aea7a5ff11eaa9c900163e08aec4', '玄奘沿着世界上千年来重要的贸易、征服及思想之路，越过冰山、穿过灼热沙漠的旅程是一次“究竟之旅”。', '公元六二九年，玄奘为寻求佛教真谛，横越亚洲展开一场史诗之旅。一千三百多年后，美国汉学家理查德·伯恩斯坦，尽一切可能追循玄奘足迹西行。从西安出发，穿过丝路绿洲，攀越险峻山隘，途经吉尔吉斯斯坦、乌兹别克斯坦、哈萨克斯坦、巴基斯坦，抵达印度，而后折返中国。玄奘西行，为解决“执卷踌躇、捧经侘傺”的根本疑惑；伯恩斯坦也试图解决自己的困惑，犹太人的身份，中年人的危机，沉默中的孤寂……与玄奘、与历史对话，他重新认识、发现了自己。', 'cb28de6f900111ea881c00ff093e0965', 20, 40.00, 46.00, 0, '2020060420072212075', 0, '2020-06-04 20:07:22', 123, 0, '2020-06-04 20:07:22', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('新版林格伦作品选集·美绘版 长袜子皮皮', '9787500794141', '2596da2ca65a11eaa9c900163e08aec4', '5a72d628a65a11eaa9c900163e08aec4', '入选“中国小学生基础阅读书目”。', '国际安徒生奖获得者林格伦的不朽经典。国内累计畅销逾两百万册。经典儿童文学。', 'c854480b900111ea881c00ff093e0965', 107, 23.00, 21.90, 0, '2020060420075832154', 1, '2020-06-04 20:07:58', 124, 0, '2020-06-04 20:07:58', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('绕着地球跑一圈.欧洲之旅', 'rw005', '0aa6c9a9a5ff11eaa9c900163e08aec4', '3f81aea7a5ff11eaa9c900163e08aec4', '是专门为3～10岁的儿童编写的地理人文知识图画书。', '以国家为主线，全书以精美逼真的图片、浅显易懂的文字、亲切细致的解读，为读者营造出一个个精彩有趣的旅行王国，让孩子们了解不同国家地区的地形地貌、历史演变、风景名胜、民俗风情、动植物、物产、城市的概况等信息，为深度体验做准备，扩展孩子的国际视野，培养孩子认知探索世界的逻辑。绕着地球跑一圈，我给爸妈当向导', 'cd3e1e68900111ea881c00ff093e0965', 46, 78.00, 88.90, 0, '2020060420092757942', 0, '2020-06-04 20:09:27', 125, 0, '2020-06-04 20:09:27', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('高中化学：必修2 ', 'jiaofu001', 'b591bf75a5ff11eaa9c900163e08aec4', 'c97a1a6fa5ff11eaa9c900163e08aec4', '普通高中课程标准实验教科书 化学2 必修是人民教育出版社出版的一本教材。', '知识清单：这是千万老教师的经验，这是无数成功者的累积。这是最系统的归纳，这是最科学的设计。将学科知识设计成习题，便于你在练习中实现对学科基本概念、基本知识的理解和记忆。实践证明，这是进行基础训练的最好方式。你要记死，不要死记。', 'cb28de6f900111ea881c00ff093e0965', 101, 45.00, 42.00, 0, '2020060420181242337', 1, '2020-06-04 20:18:12', 127, 0, '2020-06-04 20:18:12', 'zcc', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('名侦探柯南', '12321', 'ebf7c927a59011eaa9c900163e08aec4', NULL, '真像只有一个，高中生侦探被陷害成了一个充满智慧的小学生', '一个现实生活中的死神来了', 'cd3e1e68900111ea881c00ff093e0965', 22, 23.50, 19.99, 0, '2020060420410979525', 1, '2020-06-04 20:41:09', 128, 0, '2020-06-04 20:41:09', 'admin', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods` VALUES ('三国演义加强版', '56252', '908c914da59811eaa9c900163e08aec4', '7ea91112a5fe11eaa9c900163e08aec4', '天下三分', '打开的马克风骄傲激发inn覅那份拿饭合法吗foam', 'cb28de6f900111ea881c00ff093e0965', 94, 20.00, 200.00, 0, '2020060510431962327', 6, '2020-06-05 10:43:19', 131, 0, '2020-06-05 10:43:19', 'zs', '2020-06-28 17:44:47', NULL);

-- ----------------------------
-- Table structure for t_sys_goods_images
-- ----------------------------
DROP TABLE IF EXISTS `t_sys_goods_images`;
CREATE TABLE `t_sys_goods_images`  (
  `sku_code` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '商品编码',
  `sku_images_path` varchar(400) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '商品图片路径',
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `is_delete` int(11) NOT NULL COMMENT '作废标记 0:否 1:是',
  `created_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `created_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '创建人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  `updated_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '更新时间',
  `updated_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '跟新人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 160 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_sys_goods_images
-- ----------------------------
INSERT INTO `t_sys_goods_images` VALUES ('2020060414204150788', 'http://qbdu5vgqd.bkt.clouddn.com/1591251640084.jpg', 66, 0, '2020-06-04 14:20:41', 'pdc', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060414234457057', 'http://qbdu5vgqd.bkt.clouddn.com/1591251822660.jpg', 70, 0, '2020-06-04 14:23:44', 'zcc', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060418041800606', 'http://q9xwkd642.bkt.clouddn.com/1591265053927.jpg', 75, 0, '2020-06-04 18:04:18', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060418054803543', 'http://q9xwkd642.bkt.clouddn.com/1591265145091.jpg', 76, 0, '2020-06-04 18:05:48', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060418071258089', 'http://q9xwkd642.bkt.clouddn.com/1591265225594.jpg', 77, 0, '2020-06-04 18:07:12', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060418443571535', 'http://q9xwkd642.bkt.clouddn.com/1591267473840.jpg', 78, 0, '2020-06-04 18:44:35', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060418471933709', 'http://q9xwkd642.bkt.clouddn.com/1591267633566.jpg', 79, 0, '2020-06-04 18:47:19', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060418513069669', 'http://q9xwkd642.bkt.clouddn.com/1591267889514.jpg', 81, 0, '2020-06-04 18:51:30', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060418552581664', 'http://q9xwkd642.bkt.clouddn.com/1591268056323.jpg', 82, 0, '2020-06-04 18:55:25', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060418552581664', 'http://q9xwkd642.bkt.clouddn.com/1591268124075.jpg', 83, 0, '2020-06-04 18:55:26', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060418581676528', 'http://q9xwkd642.bkt.clouddn.com/1591268295578.jpg', 84, 0, '2020-06-04 18:58:16', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419000490830', 'http://q9xwkd642.bkt.clouddn.com/1591268321462.jpg', 85, 0, '2020-06-04 19:00:05', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419021897537', 'http://q9xwkd642.bkt.clouddn.com/1591268537305.jpg', 87, 0, '2020-06-04 19:02:19', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060414184344159', 'http://qbdu5vgqd.bkt.clouddn.com/1591251508170.jpg', 89, 0, '2020-06-04 19:03:21', 'pdc', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419034647163', 'http://q9xwkd642.bkt.clouddn.com/1591268625172.jpg', 90, 0, '2020-06-04 19:03:46', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419064914762', 'http://q9xwkd642.bkt.clouddn.com/1591268761986.jpg', 91, 0, '2020-06-04 19:06:49', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419075379485', 'http://q9xwkd642.bkt.clouddn.com/1591268863758.jpg', 92, 0, '2020-06-04 19:07:53', 'pdc', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419093707139', 'http://q9xwkd642.bkt.clouddn.com/1591268972090.jpg', 93, 0, '2020-06-04 19:09:37', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419093707139', 'http://q9xwkd642.bkt.clouddn.com/1591268975366.jpg', 94, 0, '2020-06-04 19:09:37', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419135873578', 'http://q9xwkd642.bkt.clouddn.com/1591269236845.jpg', 95, 0, '2020-06-04 19:13:58', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419153067830', 'http://q9xwkd642.bkt.clouddn.com/1591269301611.jpg', 96, 0, '2020-06-04 19:15:30', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419174326996', 'http://q9xwkd642.bkt.clouddn.com/1591269461968.jpg', 97, 0, '2020-06-04 19:17:43', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419192469565', 'http://q9xwkd642.bkt.clouddn.com/1591269563357.jpg', 98, 0, '2020-06-04 19:19:24', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419223799811', 'http://q9xwkd642.bkt.clouddn.com/1591269756817.jpg', 99, 0, '2020-06-04 19:22:38', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419251187415', 'http://q9xwkd642.bkt.clouddn.com/1591269911028.jpg', 100, 0, '2020-06-04 19:25:11', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419265863414', 'http://q9xwkd642.bkt.clouddn.com/1591269959414.jpg', 101, 0, '2020-06-04 19:26:58', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419294064580', 'http://q9xwkd642.bkt.clouddn.com/1591270120837.jpg', 102, 0, '2020-06-04 19:29:40', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419323820710', 'http://q9xwkd642.bkt.clouddn.com/1591270300013.jpg', 103, 0, '2020-06-04 19:32:38', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419342843854', 'http://q9xwkd642.bkt.clouddn.com/1591270459204.jpg', 104, 0, '2020-06-04 19:34:28', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419365977604', 'http://q9xwkd642.bkt.clouddn.com/1591270618708.jpg', 105, 0, '2020-06-04 19:36:59', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419392660325', 'http://q9xwkd642.bkt.clouddn.com/1591270765204.jpg', 106, 0, '2020-06-04 19:39:26', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419415726709', 'http://q9xwkd642.bkt.clouddn.com/1591270910855.jpg', 108, 0, '2020-06-04 19:41:57', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419435167864', 'http://q9xwkd642.bkt.clouddn.com/1591270985902.jpg', 109, 0, '2020-06-04 19:43:51', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419452197333', 'http://q9xwkd642.bkt.clouddn.com/1591271068313.jpg', 110, 0, '2020-06-04 19:45:22', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419464908283', 'http://q9xwkd642.bkt.clouddn.com/1591271201933.jpg', 111, 0, '2020-06-04 19:46:49', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419482895418', 'http://q9xwkd642.bkt.clouddn.com/1591271263073.jpg', 112, 0, '2020-06-04 19:48:29', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419503387459', 'http://q9xwkd642.bkt.clouddn.com/1591271397311.jpg', 113, 0, '2020-06-04 19:50:33', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419530550401', 'http://q9xwkd642.bkt.clouddn.com/1591271583685.jpg', 115, 0, '2020-06-04 19:53:05', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419544167633', 'http://q9xwkd642.bkt.clouddn.com/1591271664784.jpg', 116, 0, '2020-06-04 19:54:41', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419563290923', 'http://q9xwkd642.bkt.clouddn.com/1591271775234.jpg', 117, 0, '2020-06-04 19:56:32', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419563290923', 'http://q9xwkd642.bkt.clouddn.com/1591271791791.jpg', 118, 0, '2020-06-04 19:56:33', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419580751863', 'http://q9xwkd642.bkt.clouddn.com/1591271886727.jpg', 119, 0, '2020-06-04 19:58:07', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419585627313', 'http://q9xwkd642.bkt.clouddn.com/1591271927153.png', 120, 0, '2020-06-04 19:58:56', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419585627313', 'http://q9xwkd642.bkt.clouddn.com/1591271930536.png', 121, 0, '2020-06-04 19:58:56', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419585627313', 'http://q9xwkd642.bkt.clouddn.com/1591271934275.png', 122, 0, '2020-06-04 19:58:56', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420000557579', 'http://q9xwkd642.bkt.clouddn.com/1591271994144.jpg', 123, 0, '2020-06-04 20:00:05', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420005571300', 'http://q9xwkd642.bkt.clouddn.com/1591272038767.png', 124, 0, '2020-06-04 20:00:55', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420005571300', 'http://q9xwkd642.bkt.clouddn.com/1591272041374.png', 125, 0, '2020-06-04 20:00:55', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420005571300', 'http://q9xwkd642.bkt.clouddn.com/1591272044068.png', 126, 0, '2020-06-04 20:00:55', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420024414234', 'http://q9xwkd642.bkt.clouddn.com/1591272162394.jpg', 127, 0, '2020-06-04 20:02:44', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420024560456', 'http://q9xwkd642.bkt.clouddn.com/1591272154347.png', 128, 0, '2020-06-04 20:02:45', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420024560456', 'http://q9xwkd642.bkt.clouddn.com/1591272156814.png', 129, 0, '2020-06-04 20:02:45', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420024560456', 'http://q9xwkd642.bkt.clouddn.com/1591272159668.png', 130, 0, '2020-06-04 20:02:45', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420041190234', 'http://q9xwkd642.bkt.clouddn.com/1591272196100.jpg', 131, 0, '2020-06-04 20:04:12', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420044068262', 'http://q9xwkd642.bkt.clouddn.com/1591272266898.png', 132, 0, '2020-06-04 20:04:40', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420044068262', 'http://q9xwkd642.bkt.clouddn.com/1591272269551.png', 133, 0, '2020-06-04 20:04:40', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420044068262', 'http://q9xwkd642.bkt.clouddn.com/1591272272460.png', 134, 0, '2020-06-04 20:04:40', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420054968363', 'http://q9xwkd642.bkt.clouddn.com/1591272348303.jpg', 135, 0, '2020-06-04 20:05:49', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420065100929', 'http://q9xwkd642.bkt.clouddn.com/1591272406619.png', 136, 0, '2020-06-04 20:06:51', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420065100929', 'http://q9xwkd642.bkt.clouddn.com/1591272409788.png', 137, 0, '2020-06-04 20:06:51', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420072212075', 'http://q9xwkd642.bkt.clouddn.com/1591272397622.jpg', 138, 0, '2020-06-04 20:07:22', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420075832154', 'http://q9xwkd642.bkt.clouddn.com/1591272472353.png', 139, 0, '2020-06-04 20:07:58', 'xhl', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420092757942', 'http://q9xwkd642.bkt.clouddn.com/1591272550031.jpg', 140, 0, '2020-06-04 20:09:27', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420092757942', 'http://q9xwkd642.bkt.clouddn.com/1591272561182.jpg', 141, 0, '2020-06-04 20:09:27', 'lh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420181242337', 'http://q9xwkd642.bkt.clouddn.com/1591273090302.jpg', 146, 0, '2020-06-04 20:18:12', 'admin', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060419115241248', 'http://q9xwkd642.bkt.clouddn.com/1591274119204.jpg', 147, 0, '2020-06-04 20:35:22', 'admin', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060418281248593', 'http://q9xwkd642.bkt.clouddn.com/1591274150312.jpg', 148, 0, '2020-06-04 20:35:53', 'admin', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420410979525', 'http://q9xwkd642.bkt.clouddn.com/1591274425987.jpg', 149, 0, '2020-06-04 20:41:09', 'admin', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060420410979525', 'http://q9xwkd642.bkt.clouddn.com/1591274430922.jpg', 150, 0, '2020-06-04 20:41:09', 'admin', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060418491925188', 'http://q9xwkd642.bkt.clouddn.com/1591267757994.jpg', 151, 0, '2020-06-04 22:38:06', 'wwj', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060414174548216', 'http://q9xwkd642.bkt.clouddn.com/1591318338434.jpg', 152, 0, '2020-06-05 08:52:24', 'pdc', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060414174548216', 'http://q9xwkd642.bkt.clouddn.com/1591318342918.jpg', 153, 0, '2020-06-05 08:52:24', 'pdc', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060510431962327', 'http://q9xwkd642.bkt.clouddn.com/1591324995386.jpg', 158, 0, '2020-06-05 10:43:19', 'zs', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_goods_images` VALUES ('2020060510431962327', 'http://q9xwkd642.bkt.clouddn.com/1591324997915.jpg', 159, 0, '2020-06-05 10:43:19', 'zs', '2020-06-28 17:44:47', NULL);

-- ----------------------------
-- Table structure for t_sys_menu
-- ----------------------------
DROP TABLE IF EXISTS `t_sys_menu`;
CREATE TABLE `t_sys_menu`  (
  `menu_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '菜单名称',
  `menu_code` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '菜单编码（全表唯一） 用来创建菜单层级关系（随机数）',
  `menu_type` int(11) NOT NULL COMMENT '菜单类型 1：目录 2：菜单',
  `menu_url` varchar(400) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '菜单路由（前端页面控制（前端传值））',
  `remark` varchar(400) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '备注',
  `parent_menu_code` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '父级菜单编码（取得父级菜单 的menu_code ）',
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `is_delete` int(11) NOT NULL COMMENT '作废标记 0:否 1:是',
  `created_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `created_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '创建人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  `updated_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '更新时间',
  `updated_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '跟新人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 6 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_sys_menu
-- ----------------------------
INSERT INTO `t_sys_menu` VALUES ('用户管理', '8382e314973c11ea91d700ff093e0965', 1, NULL, '用户注册，登录，修改', '0', 3, 0, '2020-05-16 14:14:29', 'pdc', '2020-05-16 14:14:29', NULL);
INSERT INTO `t_sys_menu` VALUES ('用户注册', 'be005aa8973c11ea91d700ff093e0965', 2, '', '用户注册，登录，修改', '8382e314973c11ea91d700ff093e0965', 4, 0, '2020-05-16 14:16:07', 'pdc', '2020-05-16 14:16:07', NULL);
INSERT INTO `t_sys_menu` VALUES ('商品管理', 'f3d27a4ba07611eaa9c900163e08aec4', 1, NULL, 'string', '0', 5, 0, '2020-05-28 08:05:34', 'pdc', '2020-05-28 08:05:34', NULL);

-- ----------------------------
-- Table structure for t_sys_order
-- ----------------------------
DROP TABLE IF EXISTS `t_sys_order`;
CREATE TABLE `t_sys_order`  (
  `order_code` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '订单编码',
  `business_code` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '商家编码',
  `order_user_id` int(11) NOT NULL COMMENT '购买人ID',
  `order_status` int(11) NOT NULL COMMENT '0:已下单1:已返货 2:已完成未评价 3:已评价4: 已取消',
  `pay_status` int(11) NOT NULL COMMENT '0:未支付 1:已支付 2:退款中 3:已退款',
  `order_amount` decimal(8, 2) NOT NULL COMMENT '订单总金额',
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `is_delete` int(11) NOT NULL COMMENT '作废标记 0:否 1:是',
  `created_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `created_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '创建人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  `updated_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '更新时间',
  `updated_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '跟新人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 78 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '订单表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_sys_order
-- ----------------------------
INSERT INTO `t_sys_order` VALUES ('2020060323373733121', 'c854480b900111ea881c00ff093e0965', 26, 0, 1, 100.00, 55, 0, '2020-06-03 23:37:37', '26', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060408251369812', 'c854480b900111ea881c00ff093e0965', 26, 1, 1, 100.00, 56, 0, '2020-06-04 08:25:13', '26', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060408284573493', 'c854480b900111ea881c00ff093e0965', 26, 2, 1, 70.00, 57, 0, '2020-06-04 08:28:45', '26', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060408344843704', 'cb28de6f900111ea881c00ff093e0965', 26, 3, 1, 46.00, 58, 0, '2020-06-04 08:34:48', '26', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060408484201735', 'c854480b900111ea881c00ff093e0965', 26, 4, 1, 60.00, 59, 0, '2020-06-04 08:48:42', '26', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060408501173606', 'cd3e1e68900111ea881c00ff093e0965', 26, 3, 1, 104.00, 60, 0, '2020-06-04 08:50:11', '26', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060408514240622', 'cb28de6f900111ea881c00ff093e0965', 26, 0, 1, 46.00, 61, 0, '2020-06-04 08:51:42', '26', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060408571148873', 'cd3e1e68900111ea881c00ff093e0965', 26, 0, 1, 50.00, 62, 0, '2020-06-04 08:57:11', '26', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060414481377049', 'cb28de6f900111ea881c00ff093e0965', 38, 0, 1, 50.00, 63, 0, '2020-06-04 14:48:14', '38', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060417240932282', 'cb28de6f900111ea881c00ff093e0965', 40, 0, 1, 50.00, 64, 0, '2020-06-04 17:24:09', '40', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060417314692539', 'c854480b900111ea881c00ff093e0965', 41, 0, 1, 150.00, 65, 0, '2020-06-04 17:31:47', '41', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060420221669165', 'cb28de6f900111ea881c00ff093e0965', 26, 0, 1, 600.00, 66, 0, '2020-06-04 20:22:16', '26', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060420230161823', 'cb28de6f900111ea881c00ff093e0965', 26, 0, 1, 600.00, 67, 0, '2020-06-04 20:23:01', '26', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060420303665430', 'cb28de6f900111ea881c00ff093e0965', 41, 0, 1, 800.00, 68, 0, '2020-06-04 20:30:36', '41', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060508441474096', 'cb28de6f900111ea881c00ff093e0965', 43, 0, 1, 119.80, 69, 0, '2020-06-05 08:44:14', '43', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060508452931915', 'cd3e1e68900111ea881c00ff093e0965', 43, 0, 1, 267.99, 70, 0, '2020-06-05 08:45:29', '43', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060508452996727', 'cb28de6f900111ea881c00ff093e0965', 43, 0, 1, 113.20, 71, 0, '2020-06-05 08:45:30', '43', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060508453041887', 'c854480b900111ea881c00ff093e0965', 43, 0, 1, 61.40, 72, 0, '2020-06-05 08:45:30', '43', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060509253568699', 'cd3e1e68900111ea881c00ff093e0965', 26, 0, 1, 1000.00, 73, 0, '2020-06-05 09:25:35', '26', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060509295527601', 'cd3e1e68900111ea881c00ff093e0965', 46, 0, 1, 400.00, 74, 0, '2020-06-05 09:29:55', '46', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060509374653128', 'cb28de6f900111ea881c00ff093e0965', 46, 0, 1, 160.00, 75, 0, '2020-06-05 09:37:46', '46', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060510300866051', 'cb28de6f900111ea881c00ff093e0965', 43, 0, 1, 66.00, 76, 0, '2020-06-05 10:30:08', '43', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order` VALUES ('2020060510445173148', 'cb28de6f900111ea881c00ff093e0965', 46, 0, 1, 1200.00, 77, 0, '2020-06-05 10:44:52', '46', '2020-06-28 17:44:47', NULL);

-- ----------------------------
-- Table structure for t_sys_order_details
-- ----------------------------
DROP TABLE IF EXISTS `t_sys_order_details`;
CREATE TABLE `t_sys_order_details`  (
  `order_code` char(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '订单编码',
  `sku_code` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '商品编码',
  `shop_num` int(11) NOT NULL COMMENT '购买数量',
  `sku_amount` decimal(8, 2) NOT NULL COMMENT '购买该商品的总价',
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `is_delete` int(11) NOT NULL COMMENT '作废标记 0:否 1:是',
  `created_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `created_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '创建人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  `updated_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '更新时间',
  `updated_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '跟新人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 89 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '订单详情表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_sys_order_details
-- ----------------------------
INSERT INTO `t_sys_order_details` VALUES ('2020060323373733121', '2020060320284380853', 2, 100.00, 62, 0, '2020-06-03 23:37:37', 'try', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060408251369812', '2020060320284380853', 2, 100.00, 63, 0, '2020-06-04 08:25:13', 'try', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060408284573493', '2020060320434711786', 2, 70.00, 64, 0, '2020-06-04 08:28:45', 'try', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060408344843704', '2020060320334111863', 1, 46.00, 65, 0, '2020-06-04 08:34:48', 'try', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060408484201735', '2020060320365365676', 1, 60.00, 66, 0, '2020-06-04 08:48:42', 'try', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060408501173606', '2020060320400362917', 2, 104.00, 67, 0, '2020-06-04 08:50:11', 'try', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060408514240622', '2020060320334111863', 1, 46.00, 68, 0, '2020-06-04 08:51:42', 'try', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060408571148873', '2020060320475230968', 1, 50.00, 69, 0, '2020-06-04 08:57:11', 'try', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060414481377049', '2020060414184344159', 1, 50.00, 70, 0, '2020-06-04 14:48:13', 'two', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060417240932282', '2020060414184344159', 1, 50.00, 71, 0, '2020-06-04 17:24:09', 'hh', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060417314692539', '2020060414174548216', 3, 150.00, 72, 0, '2020-06-04 17:31:47', 'text', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060420221669165', '2020060420140899845', 3, 600.00, 73, 0, '2020-06-04 20:22:16', 'try', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060420230161823', '2020060420140899845', 3, 600.00, 74, 0, '2020-06-04 20:23:01', 'try', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060420303665430', '2020060420140899845', 4, 800.00, 75, 0, '2020-06-04 20:30:36', 'text', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060508441474096', '2020060419192469565', 2, 119.80, 76, 0, '2020-06-05 08:44:14', 'bearat', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060508452931915', '2020060419585627313', 1, 101.00, 77, 0, '2020-06-05 08:45:29', 'bearat', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060508452931915', '2020060420065100929', 1, 147.00, 78, 0, '2020-06-05 08:45:29', 'bearat', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060508452931915', '2020060420410979525', 1, 19.99, 79, 0, '2020-06-05 08:45:29', 'bearat', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060508452996727', '2020060420024560456', 1, 71.20, 80, 0, '2020-06-05 08:45:30', 'bearat', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060508452996727', '2020060420181242337', 1, 42.00, 81, 0, '2020-06-05 08:45:30', 'bearat', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060508453041887', '2020060420044068262', 1, 39.50, 82, 0, '2020-06-05 08:45:30', 'bearat', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060508453041887', '2020060420075832154', 1, 21.90, 83, 0, '2020-06-05 08:45:30', 'bearat', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060509253568699', '2020060509225967542', 5, 1000.00, 84, 0, '2020-06-05 09:25:35', 'try', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060509295527601', '2020060509225967542', 2, 400.00, 85, 0, '2020-06-05 09:29:55', 'ws', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060509374653128', '2020060509362270019', 4, 160.00, 86, 0, '2020-06-05 09:37:46', 'ws', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060510300866051', '2020060418281248593', 1, 66.00, 87, 0, '2020-06-05 10:30:08', 'bearat', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_order_details` VALUES ('2020060510445173148', '2020060510431962327', 6, 1200.00, 88, 0, '2020-06-05 10:44:51', 'ws', '2020-06-28 17:44:47', NULL);

-- ----------------------------
-- Table structure for t_sys_picture
-- ----------------------------
DROP TABLE IF EXISTS `t_sys_picture`;
CREATE TABLE `t_sys_picture`  (
  `pic_url` varchar(400) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '图片路径',
  `pic_status` int(11) NOT NULL COMMENT '图片状态 1.启用 2.禁用',
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `is_delete` int(11) NOT NULL COMMENT '作废标记 0:否 1:是',
  `created_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `created_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '创建人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  `updated_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '更新时间',
  `updated_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '跟新人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 53 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '轮播图' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_sys_picture
-- ----------------------------
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591259826870.jpg', 2, 37, 0, '2020-06-04 16:37:07', 'admin', '2020-06-04 17:22:47', 'admin');
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591259858063.jpg', 2, 38, 0, '2020-06-04 16:37:38', 'admin', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591260603030.png', 2, 39, 0, '2020-06-04 16:50:03', 'wwj', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591260612230.png', 2, 40, 0, '2020-06-04 16:50:12', 'wwj', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591260616890.jpg', 2, 41, 0, '2020-06-04 16:50:17', 'wwj', '2020-06-04 20:28:28', 'wy');
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591261809111.png', 2, 42, 0, '2020-06-04 17:10:09', 'admin', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591262324382.png', 2, 43, 1, '2020-06-04 17:18:45', 'xhl', '2020-06-04 17:33:30', 'admin');
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591262349691.png', 2, 44, 1, '2020-06-04 17:19:10', 'xhl', '2020-06-04 17:33:32', 'admin');
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591262367912.png', 2, 45, 1, '2020-06-04 17:19:28', 'xhl', '2020-06-04 17:33:33', 'admin');
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591262453147.jpg', 1, 46, 0, '2020-06-04 17:21:12', 'admin', '2020-06-04 21:08:13', 'wwj');
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591262549902.jpg', 1, 47, 0, '2020-06-04 17:22:31', 'admin', '2020-06-04 17:22:38', 'admin');
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591262579797.jpg', 2, 48, 0, '2020-06-04 17:23:03', 'admin', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591263235862.jpg', 1, 49, 0, '2020-06-04 17:33:58', 'admin', '2020-06-05 09:26:11', 'wwj');
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591314681293.jpg', 2, 50, 0, '2020-06-05 07:51:22', 'admin', '2020-06-05 09:39:50', 'admin');
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591314694220.jpg', 2, 51, 0, '2020-06-05 07:51:34', 'admin', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_picture` VALUES ('http://q9xwkd642.bkt.clouddn.com/1591442509174.png', 2, 52, 0, '2020-06-06 19:21:50', 'xhl', '2020-06-28 17:44:47', NULL);

-- ----------------------------
-- Table structure for t_sys_shopping_car
-- ----------------------------
DROP TABLE IF EXISTS `t_sys_shopping_car`;
CREATE TABLE `t_sys_shopping_car`  (
  `sku_code` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '商品编码',
  `shop_num` int(11) NOT NULL COMMENT '商品购买数量',
  `business_code` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '商家编码',
  `order_user_id` int(11) NOT NULL COMMENT '购买人ID就是用户登录人',
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `is_delete` int(11) NOT NULL COMMENT '作废标记 0:否 1:是',
  `created_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `created_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '创建人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  `updated_time` timestamp(0) NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '更新时间',
  `updated_by` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '跟新人（当前登录的用户账号，如果不存在区固定值 \"admin\"）',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 188 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '购物车' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_sys_shopping_car
-- ----------------------------
INSERT INTO `t_sys_shopping_car` VALUES ('2020060320365365676', 1, 'c854480b900111ea881c00ff093e0965', 79, 137, 0, '2020-06-03 22:52:34', 'iiii', '2020-06-28 17:44:47', NULL);
INSERT INTO `t_sys_shopping_car` VALUES ('2020060419075379485', 1, 'c854480b900111ea881c00ff093e0965', 44, 187, 0, '2020-06-05 08:56:47', 'pdcapp', '2020-06-28 17:44:47', NULL);

SET FOREIGN_KEY_CHECKS = 1;
